In [19]:
import pandas as pd
import requests

### Extraer datos

In [20]:
url = "https://officeapi.dev/api/characters/"

In [21]:
res = requests.get(url)

In [22]:
res.status_code

200

In [23]:
res_prueba = res.json()
res_prueba

{'data': [{'_id': '5e93b4a43af44260882e33b0',
   'firstname': 'Michael',
   'lastname': 'Scott',
   '__v': 0},
  {'_id': '5e93b4f03af44260882e33b1',
   'firstname': 'Jim',
   'lastname': 'Halpert',
   '__v': 0},
  {'_id': '5e93b4fa3af44260882e33b2',
   'firstname': 'Dwight',
   'lastname': 'Schrute',
   '__v': 0},
  {'_id': '5e93b50a3af44260882e33b3',
   'firstname': 'Pam',
   'lastname': 'Beesly',
   '__v': 0},
  {'_id': '5e93b5183af44260882e33b4',
   'firstname': 'Ryan',
   'lastname': 'Howard',
   '__v': 0},
  {'_id': '5e93b51e3af44260882e33b5',
   'firstname': 'Kelly',
   'lastname': 'Kapoor',
   '__v': 0},
  {'_id': '5e93b52b3af44260882e33b6',
   'firstname': 'Angela',
   'lastname': 'Martin',
   '__v': 0},
  {'_id': '5e93b5323af44260882e33b7',
   'firstname': 'Kevin',
   'lastname': 'Malone',
   '__v': 0},
  {'_id': '5e93b53b3af44260882e33b8',
   'firstname': 'Oscar',
   'lastname': 'Martinez',
   '__v': 0},
  {'_id': '5e93b5453af44260882e33b9',
   'firstname': 'Andy',
   'lastname': 'Bernard',
   '__v': 0},
  {'_id': '5e93b54d3af44260882e33ba',
   'firstname': 'Stanley',
   'lastname': 'Hudson',
   '__v': 0},
  {'_id': '5e93b5583af44260882e33bb',
   'firstname': 'Phyllis',
   'lastname': 'Lapin',
   '__v': 0},
  {'_id': '5e93b55f3af44260882e33bc',
   'firstname': 'Toby',
   'lastname': 'Flenderson',
   '__v': 0},
  {'_id': '5e93b5653af44260882e33bd',
   'firstname': 'Erin',
   'lastname': 'Hannon',
   '__v': 0},
  {'_id': '5e93b56d3af44260882e33be',
   'firstname': 'Gabe',
   'lastname': 'Lewis',
   '__v': 0},
  {'_id': '5e93b5783af44260882e33bf',
   'firstname': 'Darryl',
   'lastname': 'Philbin',
   '__v': 0},
  {'_id': '5e93b5813af44260882e33c0',
   'firstname': 'Creed',
   'lastname': 'Bratton',
   '__v': 0},
  {'_id': '5e93b58b3af44260882e33c1',
   'firstname': 'Jo',
   'lastname': 'Bennett',
   '__v': 0},
  {'_id': '5e93b5913af44260882e33c2',
   'firstname': 'Holly',
   'lastname': 'Flax',
   '__v': 0},
  {'_id': '5e93b5983af44260882e33c3',
   'firstname': 'Jan',
   'lastname': 'Levinson',
   '__v': 0},
  {'_id': '5e93b5a13af44260882e33c4',
   'firstname': 'Todd',
   'lastname': 'Packer',
   '__v': 0},
  {'_id': '5e93b5a73af44260882e33c5',
   'firstname': 'Charles',
   'lastname': 'Minor',
   '__v': 0},
  {'_id': '5e93b5ad3af44260882e33c6',
   'firstname': 'Deangelo',
   'lastname': 'Vickers',
   '__v': 0},
  {'_id': '5e93b5b63af44260882e33c7',
   'firstname': 'Josh',
   'lastname': 'Porter',
   '__v': 0},
  {'_id': '5e93b5bb3af44260882e33c8',
   'firstname': 'Ed',
   'lastname': 'Truck',
   '__v': 0},
  {'_id': '5e93b5c53af44260882e33c9',
   'firstname': 'Hunter',
   'lastname': 'null',
   '__v': 0},
  {'_id': '5e93b5d13af44260882e33ca',
   'firstname': 'David',
   'lastname': 'Wallace',
   '__v': 0},
  {'_id': '62820d17e1c40d122cd90b32',
   'firstname': 'David',
   'lastname': 'Kirui',
   '__v': 0}]}

In [24]:
l = []
for d in res_prueba:
    for value in res_prueba.values():
        l.append(value)
l = l[0]

In [25]:
l[:3]

[{'_id': '5e93b4a43af44260882e33b0',
  'firstname': 'Michael',
  'lastname': 'Scott',
  '__v': 0},
 {'_id': '5e93b4f03af44260882e33b1',
  'firstname': 'Jim',
  'lastname': 'Halpert',
  '__v': 0},
 {'_id': '5e93b4fa3af44260882e33b2',
  'firstname': 'Dwight',
  'lastname': 'Schrute',
  '__v': 0}]

In [26]:
df = pd.DataFrame(l)
df.head()

                        _id firstname lastname  __v
0  5e93b4a43af44260882e33b0   Michael    Scott    0
1  5e93b4f03af44260882e33b1       Jim  Halpert    0
2  5e93b4fa3af44260882e33b2    Dwight  Schrute    0
3  5e93b50a3af44260882e33b3       Pam   Beesly    0
4  5e93b5183af44260882e33b4      Ryan   Howard    0

In [27]:
df.drop(["__v", "_id"], axis = 1, inplace = True)
df.head()

  firstname lastname
0   Michael    Scott
1       Jim  Halpert
2    Dwight  Schrute
3       Pam   Beesly
4      Ryan   Howard

In [28]:
df.loc[df["lastname"] == "Minor", "lastname"] = "Miner"

In [29]:
df = df.rename(columns = {"firstname": "first_name", "lastname": "last_name"})

In [30]:
df["complete_name"] = df["first_name"] + " " + df["last_name"]
df.head()

  first_name last_name   complete_name
0    Michael     Scott   Michael Scott
1        Jim   Halpert     Jim Halpert
2     Dwight   Schrute  Dwight Schrute
3        Pam    Beesly      Pam Beesly
4       Ryan    Howard     Ryan Howard

In [31]:
update_df = df.drop([25, 27])

In [32]:
update_df.tail()

   first_name last_name     complete_name
21    Charles     Miner     Charles Miner
22   Deangelo   Vickers  Deangelo Vickers
23       Josh    Porter       Josh Porter
24         Ed     Truck          Ed Truck
26      David   Wallace     David Wallace

In [33]:
update_df.to_csv('apiextraction.csv', index=False)

In [35]:
update_df["complete_name"].unique()

array(['Michael Scott', 'Jim Halpert', 'Dwight Schrute', 'Pam Beesly',
       'Ryan Howard', 'Kelly Kapoor', 'Angela Martin', 'Kevin Malone',
       'Oscar Martinez', 'Andy Bernard', 'Stanley Hudson',
       'Phyllis Lapin', 'Toby Flenderson', 'Erin Hannon', 'Gabe Lewis',
       'Darryl Philbin', 'Creed Bratton', 'Jo Bennett', 'Holly Flax',
       'Jan Levinson', 'Todd Packer', 'Charles Miner', 'Deangelo Vickers',
       'Josh Porter', 'Ed Truck', 'David Wallace'], dtype=object)

In [ ]:
update_df["complete_name"].unique().size